exampleCases/example.13.piso.DTU10MW.ALMAdvanced.refinements.zmqSSC/system/decomposeParDict
/*-------------------------------*- C++ -*---------------------------------*\
|    =========                                                              |
|    \\      /     OpenFOAM                                                 |
|     \\    /                                                               |
|      \\  /       The Open Source CFD Toolbox                              |
|       \\/                                        http://www.OpenFOAM.org  |
\*-------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    note        "mesh decomposition control dictionary";
    location    "system";
    object      decomposeParDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "../setUp"


numberOfSubdomains  $nCores;
method          $decompType;
//preservePatches (north south east west);

simpleCoeffs
{
    n           $decompOrder;
    delta       0.001;
}

hierarchicalCoeffs
{
    n           (1 1 3);
    delta       0.001;
    order       xyz;
}

metisCoeffs
{
    processorWeights
    (
    );
}

scotchCoeffs
{
    //processorWeights
    //(
    //    1
    //    1
    //    1
    //    1
    //);
    //writeGraph  true;
    //strategy "b";
}

manualCoeffs
{
    dataFile    "decompositionData";
}


//// Is the case distributed
distributed     no;
//// Per slave (so nProcs-1 entries) the directory above the case.
//roots           
//(
//    "/tmp"
//    "/tmp"
//);


// ************************************************************************* //
